有三個人一起到迪士尼遊玩,中午肚子餓了,去餐廳點了一份現在最夯的冰雪奇緣
雙人組,要價 900 元,付錢後,服務生發現今天套餐大特價,只要 750 元,因此
服務生應該退還 150 元給這三個人,但是這位服務生一時鬼迷心竅,決定暗槓 60
元,只退了 90 元給這三個遊客。
那麼:三人各出 300 元 - 服務生還給他們一人 30 元 = 三人各出 270 元。270
元 × 3 人+ 服務生私吞的 60 元 = 810 + 60 = 870 !? 怎麼不是 900 元呢?還
有 30 元去哪了呢?請用敘述的方式,儘量清楚解釋問題出在哪裡。




本來套餐為 750 元，但服務生暗槓 60 等同於直接加了錢到上面，套餐價格即變成 810 元

750 + 60 = 810

而三個人各找 30, 3 * 30即為 90

810 + 90 = 900



若以結果來推論

三個人最後一個人花了 270 * 3 = 810
但實際套餐價為750
而服務生的60元暗槓費則剛好抵銷掉

若要加回900原價 則是應該要以多找回的錢來統計 也就是 90元 810 + 90 才可以得為 900
因為實際上服務生暗槓的 60 元, 成本已經加在三人所出的270元上了